Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents
The Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents class contains the identifiers for state events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.PluginStarted
Expected identification string for pick undone events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.PluginEnded
Expected identification string for plug-in ended events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.CommandStarting
Expected identification string for signaling command starting events,
which are expected to occur when TS is creating a new command context.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.CommandEnded
Expected identification string for signaling command ended events,
which are expected to occur when TS is destroying a command context.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.Interrupted
Expected identification string for interrupted events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.DirectModificationModeChanged
Expected identification string for direct modification mode changed events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.ViewOpened
Expected identification string for view opened events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.ModelChange
Expected identification string for model change events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.StartDebugFeature
Expected identification string for requests to invoke a debug tool instance.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.AppliedValuesChanged
Expected identification string for applied values changed events.